Revit 2027 API
CircuitNumberingOption Enumeration
 An enumerated type listing all the circuit numbering options.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CircuitNumberingOption
Public Enumeration CircuitNumberingOption
public enum class CircuitNumberingOption
type CircuitNumberingOption
Members
Member name | Value | Description
Continuous | 1 |  Circuit numbering type is continuous from its parent panel.
Default | 0 |  Circuit numbering type is starting from one.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace